In [1]:
#pandas with excell
import pandas as pd
import numpy as np

In [2]:
df=pd.read_excel("pandas.xlsx")
df

  Unnamed: 0  maas   yas  departman
0       atil   100  40.0   yazılım
1     zeynep   150  50.0      satış
2     mehmet   200  30.0        NaN
3      ahmet    50  10.0  pazarlama
4      atlas   150   NaN     finans
5      fatma   200  25.0      hukuk

In [3]:
fullDF=df.dropna()
#nan olan satırları attı

In [16]:
fullDF.to_excel("newSalary.xlsx")
#yeni bi excell e mevcut veriyi yaz